/* This is a mapping of BRError code failures to localized failure reasons */

/* kBRMediaManagerErrorNoPlayer*/
100 = "无法播放所选的内容。";


/* kBRMediaPlayerNoDatabaseFound*/
200 = "找不到任何内容。";

/* kBRMediaPlayerSongPlaybackError*/
201 = "不能播放当前歌曲。";


/* kBRMediaNoContent*/
300 = "未找到任何内容。";

/* kBRMediaNoPhotoContent */
301 = "您的 iPhoto 图库中没有照片。";

/* kBRMediaNoPodcastContent */
302 = "您的 iTunes 资料库中没有 podcast。";

/* kBRMediaNotDRMAuthorized */
303 = "您没有播放此内容的权限。";

/* kBRMediaNoMovieFolderContent */
304 = "您的“影片”文件夹中没有可供播放的影片。";

/* kBRMediaNoTVShowContent */
305 = "您的 iTunes 资料库中没有电视节目。";

/* kBRMediaNoMusicVideoContent */
306 = "您的 iTunes 资料库中没有音乐视频。";

/* kBRMediaNoPlaylists */
307 = "您的 iTunes 资料库中没有播放列表。";

/* kBRMediaNoSongContent */
308 = "您的 iTunes 资料库中没有歌曲。";

/* kBRMediaNoAudioBookContent */
309 = "您的 iTunes 资料库中没有有声读物。";

/* kBRMediaEmptyPlaylist */
310 = "此播放列表中没有歌曲。";

/* kBRMediaNoSuchPlaylist */
311 = "未能找到所选的播放列表。";

/* kBRMediaNoSuchSong */
312 = "未能找到所选的歌曲。";

/* kBRMediaNoMovies */
315 = "您的“影片”文件夹中没有影片。";

/* kBRMediaNoSongForSlideshow */
316 = "未能播放幻灯片显示的歌曲。";

/* kBRMediaSongPlaybackErrorDuringSlideshow */
317 = "未能播放幻灯片显示的歌曲。";

/* kBRVideoUnplayable */
318 = "未能播放选定的视频。";

/* kBRMediaRadioStreamUnplayable */
319 = "未能播放您选定的广播流。";

/* kBRRemoteMediaNoContent*/
350 = "未在此资料库中找到任何内容。";

/* kBRRemoteMediaNoPhotoContent */
351 = "此资料库中没有照片。";

/* kBRRemoteMediaNoPodcastContent */
352 = "此资料库中没有 Podcast。";

/* kBRRemoteMediaNotDRMAuthorized */
353 = "您没有播放此内容的权限。";

/* kBRRemoteMediaNoTVShowContent */
355 = "此资料库中没有电视节目。";

/* kBRRemoteMediaNoMusicVideoContent */
356 = "此资料库中没有音乐视频。";

/* kBRRemoteMediaNoPlaylists */
357 = "此资料库中没有播放列表。";

/* kBRRemoteMediaNoSongContent */
358 = "此资料库中没有歌曲。";

/* kBRRemoteMediaNoAudioBookContent */
359 = "此资料库中没有有声读物。";

/* kBRRemoteMediaEmptyPlaylist */
360 = "此播放列表中没有歌曲。";

/* kBRRemoteMediaLoadingError */
361 = "载入此内容时发生了一个错误。";

/* kBRRemotePhotoSourceUnavailableError */
363 = "照片共享源不可用。";

/* kBRDataSourceInitializationFailure*/
400 = "未找到任何内容。";

/* kBRDataSourceURLResolutionFailure*/
410 = "未找到任何内容。";

/* kBRDataSourceConnectionInProgressError */
420 = "已尝试连接到此来源。";


/* KBRSystemNetworkHostUnreachable */
501 = "不能连接到此资源库。";

/* kBRSystemErrorTrailerSiteUnreachable */
502 = "此刻无法播放电影预告片。";

/* kBRSystemNotHDCPCompliant */
503 = "必须有 HDCP 才能回放此内容。";

/* kBRSetupCantSetLanguage */
600 = "未能改变语言。";


/* kBRDVDErrorCantInitializeDVDPlaybackAlert */
750 = "此时不能播放 DVD 光盘。";

/* kBRDVDErrorCantEjectDVDAlert */
751 = "不能推出该 DVD 光盘。";

/* kBRDVDErrorBadRegionCodeAlert */
752 = "该 DVD 光盘的区域码与“DVD 播放程序”不匹配。";

/* kBRDVDErrorBadDVDMediaAlert */
753 = "不能播放该 DVD 光盘。";

/* kBRDVDErrorFatalDVDAlert */
754 = "不能播放该 DVD 光盘。";

/* kBRCDErrorCantEjectCDAlert */
755 = "不能推出 CD。";

/*	kDVDErrorAuthentification = -70025,	The user attempting to change the region code could not be authenticated. */
-70025 = "不能验证该光盘的拷贝保护。";

/* kBRInternalResourceError */
900 = "发生错误。";

